tutorials/rhoPisoFoam/ras/cavity/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Turbulence model selection
RASModel            kOmegaSST; //kEpsilon;

// Do you wish to calculate turbulence?
turbulence          on;

printCoeffs         on;

// Laminar model coefficients
laminarCoeffs
{
}

// Standard k-epsilon model coefficients
kEpsilonCoeffs
{
    // Cmu
    Cmu              0.09;
    // C1
    C1               1.44;
    // C2
    C2               1.92;
    // C3
    C3               -0.33;
    // alphah
    alphah           1;
    // alphak
    alphak           1;
    // alphaEps
    alphaEps         0.76923;
}

// RNG k-epsilon model coefficients
RNGkEpsilonCoeffs
{
    // Cmu
    Cmu              0.0845;
    // C1
    C1               1.42;
    // C2
    C2               1.68;
    // C3
    C3               -0.33;
    // alphah
    alphah           1;
    // alphak
    alphak           1.39;
    // alphaEps
    alphaEps         1.39;
    // eta0
    eta0             4.38;
    // beta
    beta             0.012;
}

// Launder-Sharma low Reynolds number k-epsilon model coefficients
LaunderSharmaKECoeffs
{
    // Cmu
    Cmu              0.09;
    // C1
    C1               1.44;
    // C2
    C2               1.92;
    // C3
    C3               -0.33;
    // alphah
    alphah           1;
    // alphak
    alphak           1;
    // alphaEps
    alphaEps         0.76923;
}

// Launder-Reece-Rodi RSTM with wall functions model coefficients
LRRCoeffs
{
    // Cmu
    Cmu              0.09;
    // Clrr1
    Clrr1            1.8;
    // Clrr2
    Clrr2            0.6;
    // C1
    C1               1.44;
    // C2
    C2               1.92;
    // Cs
    Cs               0.25;
    // Ceps
    Ceps             0.15;
    // alphah
    alphah           1;
    // alphaEps
    alphaEps         0.76923;
    // alphaR
    alphaR           1.22;
}

// Launder-Gibson RSTM with wall reflection and wall functions model coefficients
LaunderGibsonRSTMCoeffs
{
    // Cmu
    Cmu              0.09;
    // Clg1
    Clg1             1.8;
    // Clg2
    Clg2             0.6;
    // C1
    C1               1.44;
    // C2
    C2               1.92;
    // C1Ref
    C1Ref            0.5;
    // C2Ref
    C2Ref            0.3;
    // Cs
    Cs               0.25;
    // Ceps
    Ceps             0.15;
    // alphah
    alphah           1;
    // alphaEps
    alphaEps         0.76923;
    // alphaR
    alphaR           1.22;
}

kOmegaSSTCoeffs
{
    alphaK1          0.85034;
    alphaK2          1.0;
    alphaOmega1      0.5;
    alphaOmega2      0.85616;
    gamma1           0.5532;
    gamma2           0.4403;
    beta1            0.0750;
    beta2            0.0828;
    betaStar         0.09;
    a1               0.31;
    c1               10;

    Cmu              0.09;

    alphah           1;
}

// Wall function coefficients
wallFunctionCoeffs
{
    // kappa
    kappa            0.4187;
    // E
    E                9;
}

// ************************************************************************* //
